QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB32def.inc
.equ SLPCTRL_CTRLA = 0x0050              ; Control A

;*************************************************************************
;** SPI0 - Serial Peripheral Interface
;*************************************************************************

.equ SPI0_CTRLA = 0x0940                 ; Control A
.equ SPI0_CTRLB = 0x0941                 ; Control B
.equ SPI0_INTCTRL = 0x0942               ; Interrupt Control
.equ SPI0_INTFLAGS = 0x0943              ; Interrupt Flags
.equ SPI0_DATA = 0x0944                  ; Data

;*************************************************************************
;** SYSCFG - System Configuration Registers
;*************************************************************************

.equ SYSCFG_REVID = 0x0F01               ; Revision ID

;*************************************************************************
;** TCB0 - 16-bit Timer/Counter Type B
;*************************************************************************

.equ TCB0_CTRLA = 0x0B00                 ; Control A
.equ TCB0_CTRLB = 0x0B01                 ; Control B
.equ TCB0_CTRLC = 0x0B02                 ; Control C
.equ TCB0_EVCTRL = 0x0B04                ; Event Control
.equ TCB0_INTCTRL = 0x0B05               ; Interrupt Control
.equ TCB0_INTFLAGS = 0x0B06              ; Interrupt Flags
.equ TCB0_STATUS = 0x0B07                ; Status
.equ TCB0_DBGCTRL = 0x0B08               ; Debug Control
.equ TCB0_TEMP = 0x0B09                  ; Temporary Value
.equ TCB0_CNT = 0x0B0A                   ; Count
.equ TCB0_CNTL = 0x0B0A                  ; Count low byte
.equ TCB0_CNTH = 0x0B0B                  ; Count hi byte
.equ TCB0_CCMP = 0x0B0C                  ; Compare or Capture
.equ TCB0_CCMPL = 0x0B0C                 ; Compare or Capture low byte
.equ TCB0_CCMPH = 0x0B0D                 ; Compare or Capture hi byte

;*************************************************************************
;** TCB1 - 16-bit Timer/Counter Type B
;*************************************************************************

.equ TCB1_CTRLA = 0x0B10                 ; Control A
.equ TCB1_CTRLB = 0x0B11                 ; Control B
.equ TCB1_CTRLC = 0x0B12                 ; Control C
.equ TCB1_EVCTRL = 0x0B14                ; Event Control
.equ TCB1_INTCTRL = 0x0B15               ; Interrupt Control
.equ TCB1_INTFLAGS = 0x0B16              ; Interrupt Flags
.equ TCB1_STATUS = 0x0B17                ; Status
.equ TCB1_DBGCTRL = 0x0B18               ; Debug Control
.equ TCB1_TEMP = 0x0B19                  ; Temporary Value
.equ TCB1_CNT = 0x0B1A                   ; Count
.equ TCB1_CNTL = 0x0B1A                  ; Count low byte
.equ TCB1_CNTH = 0x0B1B                  ; Count hi byte
.equ TCB1_CCMP = 0x0B1C                  ; Compare or Capture
.equ TCB1_CCMPL = 0x0B1C                 ; Compare or Capture low byte
.equ TCB1_CCMPH = 0x0B1D                 ; Compare or Capture hi byte

;*************************************************************************
;** TCE0 - 16-bit Timer/Counter Type E
;*************************************************************************

.equ TCE0_CTRLA = 0x0A00                 ; Control A
.equ TCE0_CTRLB = 0x0A01                 ; Control B
.equ TCE0_CTRLC = 0x0A02                 ; Control C
.equ TCE0_CTRLD = 0x0A03                 ; Control D
.equ TCE0_CTRLECLR = 0x0A04              ; Control E Clear
.equ TCE0_CTRLESET = 0x0A05              ; Control E Set
.equ TCE0_CTRLFCLR = 0x0A06              ; Control F Clear
.equ TCE0_CTRLFSET = 0x0A07              ; Control F Set
.equ TCE0_EVGENCTRL = 0x0A08             ; Event Generation Control
.equ TCE0_EVCTRL = 0x0A09                ; Event Control
.equ TCE0_INTCTRL = 0x0A0A               ; Interrupt Control
.equ TCE0_INTFLAGS = 0x0A0B              ; Interrupt Flags
.equ TCE0_DBGCTRL = 0x0A0E               ; Debug Control
.equ TCE0_TEMP = 0x0A0F                  ; Temporary data for 16-bit Access
.equ TCE0_CNT = 0x0A20                   ; Count
.equ TCE0_CNTL = 0x0A20                  ; Count low byte
.equ TCE0_CNTH = 0x0A21                  ; Count hi byte
.equ TCE0_AMP = 0x0A22                   ; Amplitude
.equ TCE0_AMPL = 0x0A22                  ; Amplitude low byte
.equ TCE0_AMPH = 0x0A23                  ; Amplitude hi byte
.equ TCE0_OFFSET = 0x0A24                ; Offset
.equ TCE0_OFFSETL = 0x0A24               ; Offset low byte
.equ TCE0_OFFSETH = 0x0A25               ; Offset hi byte
.equ TCE0_PER = 0x0A26                   ; Period
.equ TCE0_PERL = 0x0A26                  ; Period low byte
.equ TCE0_PERH = 0x0A27                  ; Period hi byte
.equ TCE0_CMP0 = 0x0A28                  ; Compare 0
.equ TCE0_CMP0L = 0x0A28                 ; Compare 0 low byte
.equ TCE0_CMP0H = 0x0A29                 ; Compare 0 hi byte
.equ TCE0_CMP1 = 0x0A2A                  ; Compare 1
.equ TCE0_CMP1L = 0x0A2A                 ; Compare 1 low byte
.equ TCE0_CMP1H = 0x0A2B                 ; Compare 1 hi byte
.equ TCE0_CMP2 = 0x0A2C                  ; Compare 2
.equ TCE0_CMP2L = 0x0A2C                 ; Compare 2 low byte
.equ TCE0_CMP2H = 0x0A2D                 ; Compare 2 hi byte
.equ TCE0_CMP3 = 0x0A2E                  ; Compare 3
.equ TCE0_CMP3L = 0x0A2E                 ; Compare 3 low byte
.equ TCE0_CMP3H = 0x0A2F                 ; Compare 3 hi byte
.equ TCE0_PERBUF = 0x0A36                ; Period Buffer
.equ TCE0_PERBUFL = 0x0A36               ; Period Buffer low byte
.equ TCE0_PERBUFH = 0x0A37               ; Period Buffer hi byte
.equ TCE0_CMP0BUF = 0x0A38               ; Compare 0 Buffer
.equ TCE0_CMP0BUFL = 0x0A38              ; Compare 0 Buffer low byte
.equ TCE0_CMP0BUFH = 0x0A39              ; Compare 0 Buffer hi byte
.equ TCE0_CMP1BUF = 0x0A3A               ; Compare 1 Buffer
.equ TCE0_CMP1BUFL = 0x0A3A              ; Compare 1 Buffer low byte
.equ TCE0_CMP1BUFH = 0x0A3B              ; Compare 1 Buffer hi byte
.equ TCE0_CMP2BUF = 0x0A3C               ; Compare 2 Buffer
.equ TCE0_CMP2BUFL = 0x0A3C              ; Compare 2 Buffer low byte
.equ TCE0_CMP2BUFH = 0x0A3D              ; Compare 2 Buffer hi byte
.equ TCE0_CMP3BUF = 0x0A3E               ; Compare 3 Buffer
.equ TCE0_CMP3BUFL = 0x0A3E              ; Compare 3 Buffer low byte
.equ TCE0_CMP3BUFH = 0x0A3F              ; Compare 3 Buffer hi byte

;*************************************************************************
;** TCF0 - 24-bit Timer/Counter for frequency generation
;*************************************************************************

.equ TCF0_CTRLA = 0x0C00                 ; Control A
.equ TCF0_CTRLB = 0x0C01                 ; Control B
.equ TCF0_CTRLC = 0x0C02                 ; Control C
.equ TCF0_CTRLD = 0x0C03                 ; Control D
.equ TCF0_EVCTRL = 0x0C04                ; Event Control
.equ TCF0_INTCTRL = 0x0C05               ; Interrupt Control
.equ TCF0_INTFLAGS = 0x0C06              ; Interrupt Flags
.equ TCF0_STATUS = 0x0C07                ; Status
.equ TCF0_DBGCTRL = 0x0C0D               ; Debug Control
.equ TCF0_CNT = 0x0C10                   ; Count
.equ TCF0_CNT0 = 0x0C10                  ; Count 0
.equ TCF0_CNT1 = 0x0C11                  ; Count 1
.equ TCF0_CNT2 = 0x0C12                  ; Count 2
.equ TCF0_CNT3 = 0x0C13                  ; Count 3
.equ TCF0_CMP = 0x0C14                   ; Compare
.equ TCF0_CMP0 = 0x0C14                  ; Compare 0
.equ TCF0_CMP1 = 0x0C15                  ; Compare 1
.equ TCF0_CMP2 = 0x0C16                  ; Compare 2
.equ TCF0_CMP3 = 0x0C17                  ; Compare 3

;*************************************************************************
;** TWI0 - Two-Wire Interface
;*************************************************************************

.equ TWI0_CTRLA = 0x0900                 ; Control A
.equ TWI0_DUALCTRL = 0x0901              ; Dual Mode Control
.equ TWI0_DBGCTRL = 0x0902               ; Debug Control
.equ TWI0_MCTRLA = 0x0903                ; Host Control A
.equ TWI0_MCTRLB = 0x0904                ; Host Control B
.equ TWI0_MSTATUS = 0x0905               ; Host STATUS
.equ TWI0_MBAUD = 0x0906                 ; Host Baud Rate
.equ TWI0_MADDR = 0x0907                 ; Host Address
.equ TWI0_MDATA = 0x0908                 ; Host Data
.equ TWI0_SCTRLA = 0x0909                ; Client Control A
.equ TWI0_SCTRLB = 0x090A                ; Client Control B
.equ TWI0_SSTATUS = 0x090B               ; Client Status
.equ TWI0_SADDR = 0x090C                 ; Client Address
.equ TWI0_SDATA = 0x090D                 ; Client Data
.equ TWI0_SADDRMASK = 0x090E             ; Client Address Mask

;*************************************************************************
;** USART0 - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************

.equ USART0_RXDATAL = 0x0800             ; Receive Data Low Byte
.equ USART0_RXDATAH = 0x0801             ; Receive Data High Byte
.equ USART0_TXDATAL = 0x0802             ; Transmit Data Low Byte
.equ USART0_TXDATAH = 0x0803             ; Transmit Data High Byte
.equ USART0_STATUS = 0x0804              ; Status
.equ USART0_CTRLA = 0x0805               ; Control A
.equ USART0_CTRLB = 0x0806               ; Control B
.equ USART0_CTRLC = 0x0807               ; Control C
.equ USART0_BAUD = 0x0808                ; Baud Rate
.equ USART0_BAUDL = 0x0808               ; Baud Rate low byte
.equ USART0_BAUDH = 0x0809               ; Baud Rate hi byte
.equ USART0_CTRLD = 0x080A               ; Control D
.equ USART0_DBGCTRL = 0x080B             ; Debug Control
.equ USART0_EVCTRL = 0x080C              ; Event Control
.equ USART0_TXPLCTRL = 0x080D            ; IRCOM Transmitter Pulse Length Control
.equ USART0_RXPLCTRL = 0x080E            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USERROW - User Row
;*************************************************************************

.equ USERROW_USERROW0 = 0x1200           ; User Row Byte 0
.equ USERROW_USERROW1 = 0x1201           ; User Row Byte 1
.equ USERROW_USERROW2 = 0x1202           ; User Row Byte 2
.equ USERROW_USERROW3 = 0x1203           ; User Row Byte 3
.equ USERROW_USERROW4 = 0x1204           ; User Row Byte 4
.equ USERROW_USERROW5 = 0x1205           ; User Row Byte 5
.equ USERROW_USERROW6 = 0x1206           ; User Row Byte 6
.equ USERROW_USERROW7 = 0x1207           ; User Row Byte 7
.equ USERROW_USERROW8 = 0x1208           ; User Row Byte 8
.equ USERROW_USERROW9 = 0x1209           ; User Row Byte 9
.equ USERROW_USERROW10 = 0x120A          ; User Row Byte 10
.equ USERROW_USERROW11 = 0x120B          ; User Row Byte 11
.equ USERROW_USERROW12 = 0x120C          ; User Row Byte 12
.equ USERROW_USERROW13 = 0x120D          ; User Row Byte 13
.equ USERROW_USERROW14 = 0x120E          ; User Row Byte 14
.equ USERROW_USERROW15 = 0x120F          ; User Row Byte 15
.equ USERROW_USERROW16 = 0x1210          ; User Row Byte 16
.equ USERROW_USERROW17 = 0x1211          ; User Row Byte 17
.equ USERROW_USERROW18 = 0x1212          ; User Row Byte 18
.equ USERROW_USERROW19 = 0x1213          ; User Row Byte 19
.equ USERROW_USERROW20 = 0x1214          ; User Row Byte 20
.equ USERROW_USERROW21 = 0x1215          ; User Row Byte 21
.equ USERROW_USERROW22 = 0x1216          ; User Row Byte 22
.equ USERROW_USERROW23 = 0x1217          ; User Row Byte 23
.equ USERROW_USERROW24 = 0x1218          ; User Row Byte 24
.equ USERROW_USERROW25 = 0x1219          ; User Row Byte 25
.equ USERROW_USERROW26 = 0x121A          ; User Row Byte 26
.equ USERROW_USERROW27 = 0x121B          ; User Row Byte 27
.equ USERROW_USERROW28 = 0x121C          ; User Row Byte 28
.equ USERROW_USERROW29 = 0x121D          ; User Row Byte 29
.equ USERROW_USERROW30 = 0x121E          ; User Row Byte 30
.equ USERROW_USERROW31 = 0x121F          ; User Row Byte 31
.equ USERROW_USERROW32 = 0x1220          ; User Row Byte 32
.equ USERROW_USERROW33 = 0x1221          ; User Row Byte 33
.equ USERROW_USERROW34 = 0x1222          ; User Row Byte 34
.equ USERROW_USERROW35 = 0x1223          ; User Row Byte 35
.equ USERROW_USERROW36 = 0x1224          ; User Row Byte 36
.equ USERROW_USERROW37 = 0x1225          ; User Row Byte 37
.equ USERROW_USERROW38 = 0x1226          ; User Row Byte 38
.equ USERROW_USERROW39 = 0x1227          ; User Row Byte 39
.equ USERROW_USERROW40 = 0x1228          ; User Row Byte 40
.equ USERROW_USERROW41 = 0x1229          ; User Row Byte 41
.equ USERROW_USERROW42 = 0x122A          ; User Row Byte 42
.equ USERROW_USERROW43 = 0x122B          ; User Row Byte 43
.equ USERROW_USERROW44 = 0x122C          ; User Row Byte 44
.equ USERROW_USERROW45 = 0x122D          ; User Row Byte 45
.equ USERROW_USERROW46 = 0x122E          ; User Row Byte 46
.equ USERROW_USERROW47 = 0x122F          ; User Row Byte 47
.equ USERROW_USERROW48 = 0x1230          ; User Row Byte 48
.equ USERROW_USERROW49 = 0x1231          ; User Row Byte 49
.equ USERROW_USERROW50 = 0x1232          ; User Row Byte 50
.equ USERROW_USERROW51 = 0x1233          ; User Row Byte 51
.equ USERROW_USERROW52 = 0x1234          ; User Row Byte 52
.equ USERROW_USERROW53 = 0x1235          ; User Row Byte 53
.equ USERROW_USERROW54 = 0x1236          ; User Row Byte 54
.equ USERROW_USERROW55 = 0x1237          ; User Row Byte 55
.equ USERROW_USERROW56 = 0x1238          ; User Row Byte 56
.equ USERROW_USERROW57 = 0x1239          ; User Row Byte 57
.equ USERROW_USERROW58 = 0x123A          ; User Row Byte 58
.equ USERROW_USERROW59 = 0x123B          ; User Row Byte 59
.equ USERROW_USERROW60 = 0x123C          ; User Row Byte 60
.equ USERROW_USERROW61 = 0x123D          ; User Row Byte 61
.equ USERROW_USERROW62 = 0x123E          ; User Row Byte 62
.equ USERROW_USERROW63 = 0x123F          ; User Row Byte 63

;*************************************************************************
;** VPORTA - Virtual Ports
;*************************************************************************

.equ VPORTA_DIR = 0x0000                 ; Data Direction
.equ VPORTA_OUT = 0x0001                 ; Output Value
.equ VPORTA_IN = 0x0002                  ; Input Value
.equ VPORTA_INTFLAGS = 0x0003            ; Interrupt Flags

;*************************************************************************
;** VPORTC - Virtual Ports
;*************************************************************************

.equ VPORTC_DIR = 0x0008                 ; Data Direction
.equ VPORTC_OUT = 0x0009                 ; Output Value
.equ VPORTC_IN = 0x000A                  ; Input Value
.equ VPORTC_INTFLAGS = 0x000B            ; Interrupt Flags

;*************************************************************************
;** VPORTD - Virtual Ports
;*************************************************************************

.equ VPORTD_DIR = 0x000C                 ; Data Direction
.equ VPORTD_OUT = 0x000D                 ; Output Value
.equ VPORTD_IN = 0x000E                  ; Input Value
.equ VPORTD_INTFLAGS = 0x000F            ; Interrupt Flags

;*************************************************************************
;** VPORTF - Virtual Ports
;*************************************************************************

