QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB32def.inc
; Hysteresis Mode select
.equ AC_HYSMODE_NONE_gc = (0x00<<1)      ; No hysteresis
.equ AC_HYSMODE_SMALL_gc = (0x01<<1)     ; Small hysteresis
.equ AC_HYSMODE_MEDIUM_gc = (0x02<<1)    ; Medium hysteresis
.equ AC_HYSMODE_LARGE_gc = (0x03<<1)     ; Large hysteresis

; Power profile select
.equ AC_POWER_PROFILE0_gc = (0x00<<3)    ; Power profile 0, Fastest response time, highest consumption
.equ AC_POWER_PROFILE1_gc = (0x01<<3)    ; Power profile 1

; Window selection mode
.equ AC_WINSEL_DISABLED_gc = (0x00<<0)   ; Window function disabled
.equ AC_WINSEL_UPSEL1_gc = (0x01<<0)     ; Select ACn+1 as upper limit in window compare

; Interrupt Mode select
.equ AC_NORMAL_INTMODE_BOTHEDGE_gc = (0x00<<4) ; Positive and negative inputs crosses
.equ AC_NORMAL_INTMODE_NEGEDGE_gc = (0x02<<4) ; Positive input goes below negative input
.equ AC_NORMAL_INTMODE_POSEDGE_gc = (0x03<<4) ; Positive input goes above negative input

; Interrupt Mode select
.equ AC_WINDOW_INTMODE_ABOVE_gc = (0x00<<4) ; Window interrupt when input above both references
.equ AC_WINDOW_INTMODE_INSIDE_gc = (0x01<<4) ; Window interrupt when input betweeen references
.equ AC_WINDOW_INTMODE_BELOW_gc = (0x02<<4) ; Window interrupt when input below both references
.equ AC_WINDOW_INTMODE_OUTSIDE_gc = (0x03<<4) ; Window interrupt when input outside reference

; AC Output Initial Value select
.equ AC_INITVAL_LOW_gc = (0x00<<6)       ; Output initialized to 0
.equ AC_INITVAL_HIGH_gc = (0x01<<6)      ; Output initialized to 1

; Negative Input MUX Selection
.equ AC_MUXNEG_AINN0_gc = (0x00<<0)      ; Negative Pin 0
.equ AC_MUXNEG_AINN1_gc = (0x01<<0)      ; Negative Pin 1
.equ AC_MUXNEG_AINN2_gc = (0x02<<0)      ; Negative Pin 2
.equ AC_MUXNEG_AINN3_gc = (0x03<<0)      ; Negative Pin 3
.equ AC_MUXNEG_DACREF_gc = (0x04<<0)     ; DAC Reference

; Positive Input MUX Selection
.equ AC_MUXPOS_AINP0_gc = (0x00<<3)      ; Positive Pin 0
.equ AC_MUXPOS_AINP1_gc = (0x01<<3)      ; Positive Pin 1
.equ AC_MUXPOS_AINP2_gc = (0x02<<3)      ; Positive Pin 2
.equ AC_MUXPOS_AINP3_gc = (0x03<<3)      ; Positive Pin 3
.equ AC_MUXPOS_AINP4_gc = (0x04<<3)      ; Positive Pin 4
.equ AC_MUXPOS_AINP5_gc = (0x05<<3)      ; Positive Pin 5
.equ AC_MUXPOS_AINP6_gc = (0x06<<3)      ; Positive Pin 6

; Analog Comparator Window State select
.equ AC_WINSTATE_ABOVE_gc = (0x00<<6)    ; Above window
.equ AC_WINSTATE_INSIDE_gc = (0x01<<6)   ; Inside window
.equ AC_WINSTATE_BELOW_gc = (0x02<<6)    ; Below window


;*************************************************************************
;** ADC - Analog to Digital Converter
;*************************************************************************

; ADC_CTRLA masks
.equ ADC_ENABLE_bm = 0x01                ; ADC Enable bit mask
.equ ADC_ENABLE_bp = 0                   ; ADC Enable bit position
.equ ADC_LOWLAT_bm = 0x20                ; Low Latency bit mask
.equ ADC_LOWLAT_bp = 5                   ; Low Latency bit position
.equ ADC_RUNSTDBY_bm = 0x80              ; Run in Standby bit mask
.equ ADC_RUNSTDBY_bp = 7                 ; Run in Standby bit position

; ADC_CTRLB masks
.equ ADC_PRESC_gm = 0x0F                 ; Prescaler Value group mask
.equ ADC_PRESC_gp = 0                    ; Prescaler Value group position
.equ ADC_PRESC_0_bm = (1<<0)             ; Prescaler Value bit 0 mask
.equ ADC_PRESC_0_bp = 0                  ; Prescaler Value bit 0 position
.equ ADC_PRESC_1_bm = (1<<1)             ; Prescaler Value bit 1 mask
.equ ADC_PRESC_1_bp = 1                  ; Prescaler Value bit 1 position
.equ ADC_PRESC_2_bm = (1<<2)             ; Prescaler Value bit 2 mask
.equ ADC_PRESC_2_bp = 2                  ; Prescaler Value bit 2 position
.equ ADC_PRESC_3_bm = (1<<3)             ; Prescaler Value bit 3 mask
.equ ADC_PRESC_3_bp = 3                  ; Prescaler Value bit 3 position

; ADC_CTRLC masks
.equ ADC_REFSEL_gm = 0x07                ; Reference select group mask
.equ ADC_REFSEL_gp = 0                   ; Reference select group position
.equ ADC_REFSEL_0_bm = (1<<0)            ; Reference select bit 0 mask
.equ ADC_REFSEL_0_bp = 0                 ; Reference select bit 0 position
.equ ADC_REFSEL_1_bm = (1<<1)            ; Reference select bit 1 mask
.equ ADC_REFSEL_1_bp = 1                 ; Reference select bit 1 position
.equ ADC_REFSEL_2_bm = (1<<2)            ; Reference select bit 2 mask
.equ ADC_REFSEL_2_bp = 2                 ; Reference select bit 2 position

; ADC_CTRLD masks
.equ ADC_WINCM_gm = 0x07                 ; Window Comparator Mode group mask
.equ ADC_WINCM_gp = 0                    ; Window Comparator Mode group position
.equ ADC_WINCM_0_bm = (1<<0)             ; Window Comparator Mode bit 0 mask
.equ ADC_WINCM_0_bp = 0                  ; Window Comparator Mode bit 0 position
.equ ADC_WINCM_1_bm = (1<<1)             ; Window Comparator Mode bit 1 mask
.equ ADC_WINCM_1_bp = 1                  ; Window Comparator Mode bit 1 position
.equ ADC_WINCM_2_bm = (1<<2)             ; Window Comparator Mode bit 2 mask
.equ ADC_WINCM_2_bp = 2                  ; Window Comparator Mode bit 2 position
.equ ADC_WINSRC_bm = 0x08                ; Window Mode Source bit mask
.equ ADC_WINSRC_bp = 3                   ; Window Mode Source bit position

; ADC_INTCTRL masks
.equ ADC_RESRDY_bm = 0x01                ; Result Ready Interrupt Enable bit mask
.equ ADC_RESRDY_bp = 0                   ; Result Ready Interrupt Enable bit position
.equ ADC_SAMPRDY_bm = 0x02               ; Sample Ready Interrupt Enable bit mask
.equ ADC_SAMPRDY_bp = 1                  ; Sample Ready Interrupt Enable bit position
.equ ADC_WCMP_bm = 0x04                  ; Window Comparator Interrupt Enable bit mask
.equ ADC_WCMP_bp = 2                     ; Window Comparator Interrupt Enable bit position
.equ ADC_RESOVR_bm = 0x08                ; Result Overwrite Interrupt Enable bit mask
.equ ADC_RESOVR_bp = 3                   ; Result Overwrite Interrupt Enable bit position
.equ ADC_SAMPOVR_bm = 0x10               ; Sample Overwrite Interrupt Enable bit mask
.equ ADC_SAMPOVR_bp = 4                  ; Sample Overwrite Interrupt Enable bit position
.equ ADC_TRIGOVR_bm = 0x20               ; Trigger Overrun Interrupt Enable bit mask
.equ ADC_TRIGOVR_bp = 5                  ; Trigger Overrun Interrupt Enable bit position

