QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB32def.inc
; NVMCTRL_CTRLA masks
.equ NVMCTRL_CMD_gm = 0x7F               ; Command group mask
.equ NVMCTRL_CMD_gp = 0                  ; Command group position
.equ NVMCTRL_CMD_0_bm = (1<<0)           ; Command bit 0 mask
.equ NVMCTRL_CMD_0_bp = 0                ; Command bit 0 position
.equ NVMCTRL_CMD_1_bm = (1<<1)           ; Command bit 1 mask
.equ NVMCTRL_CMD_1_bp = 1                ; Command bit 1 position
.equ NVMCTRL_CMD_2_bm = (1<<2)           ; Command bit 2 mask
.equ NVMCTRL_CMD_2_bp = 2                ; Command bit 2 position
.equ NVMCTRL_CMD_3_bm = (1<<3)           ; Command bit 3 mask
.equ NVMCTRL_CMD_3_bp = 3                ; Command bit 3 position
.equ NVMCTRL_CMD_4_bm = (1<<4)           ; Command bit 4 mask
.equ NVMCTRL_CMD_4_bp = 4                ; Command bit 4 position
.equ NVMCTRL_CMD_5_bm = (1<<5)           ; Command bit 5 mask
.equ NVMCTRL_CMD_5_bp = 5                ; Command bit 5 position
.equ NVMCTRL_CMD_6_bm = (1<<6)           ; Command bit 6 mask
.equ NVMCTRL_CMD_6_bp = 6                ; Command bit 6 position

; NVMCTRL_CTRLB masks
.equ NVMCTRL_APPCODEWP_bm = 0x01         ; Application Code Write Protect bit mask
.equ NVMCTRL_APPCODEWP_bp = 0            ; Application Code Write Protect bit position
.equ NVMCTRL_BOOTRP_bm = 0x02            ; Boot Read Protect bit mask
.equ NVMCTRL_BOOTRP_bp = 1               ; Boot Read Protect bit position
.equ NVMCTRL_APPDATAWP_bm = 0x04         ; Application Data Write Protect bit mask
.equ NVMCTRL_APPDATAWP_bp = 2            ; Application Data Write Protect bit position
.equ NVMCTRL_EEWP_bm = 0x08              ; EEPROM Write Protect bit mask
.equ NVMCTRL_EEWP_bp = 3                 ; EEPROM Write Protect bit position
.equ NVMCTRL_FLMAP_gm = 0x30             ; Flash Mapping in Data space group mask
.equ NVMCTRL_FLMAP_gp = 4                ; Flash Mapping in Data space group position
.equ NVMCTRL_FLMAP_0_bm = (1<<4)         ; Flash Mapping in Data space bit 0 mask
.equ NVMCTRL_FLMAP_0_bp = 4              ; Flash Mapping in Data space bit 0 position
.equ NVMCTRL_FLMAP_1_bm = (1<<5)         ; Flash Mapping in Data space bit 1 mask
.equ NVMCTRL_FLMAP_1_bp = 5              ; Flash Mapping in Data space bit 1 position
.equ NVMCTRL_FLMAPLOCK_bm = 0x80         ; Flash Mapping Lock bit mask
.equ NVMCTRL_FLMAPLOCK_bp = 7            ; Flash Mapping Lock bit position

; NVMCTRL_CTRLC masks
.equ NVMCTRL_UROWWP_bm = 0x01            ; User Row Write Protect bit mask
.equ NVMCTRL_UROWWP_bp = 0               ; User Row Write Protect bit position
.equ NVMCTRL_BOOTROWWP_bm = 0x02         ; Boot Row Write Protect bit mask
.equ NVMCTRL_BOOTROWWP_bp = 1            ; Boot Row Write Protect bit position

; NVMCTRL_INTCTRL masks
.equ NVMCTRL_EEREADY_bm = 0x01           ; EEPROM Ready bit mask
.equ NVMCTRL_EEREADY_bp = 0              ; EEPROM Ready bit position
.equ NVMCTRL_FLREADY_bm = 0x02           ; Flash Ready bit mask
.equ NVMCTRL_FLREADY_bp = 1              ; Flash Ready bit position

; NVMCTRL_INTFLAGS masks
; Masks for NVMCTRL_EEREADY already defined
; Masks for NVMCTRL_FLREADY already defined

; NVMCTRL_STATUS masks
.equ NVMCTRL_EEBUSY_bm = 0x01            ; EEPROM busy bit mask
.equ NVMCTRL_EEBUSY_bp = 0               ; EEPROM busy bit position
.equ NVMCTRL_FLBUSY_bm = 0x02            ; Flash busy bit mask
.equ NVMCTRL_FLBUSY_bp = 1               ; Flash busy bit position
.equ NVMCTRL_ERROR_gm = 0x70             ; Write error group mask
.equ NVMCTRL_ERROR_gp = 4                ; Write error group position
.equ NVMCTRL_ERROR_0_bm = (1<<4)         ; Write error bit 0 mask
.equ NVMCTRL_ERROR_0_bp = 4              ; Write error bit 0 position
.equ NVMCTRL_ERROR_1_bm = (1<<5)         ; Write error bit 1 mask
.equ NVMCTRL_ERROR_1_bp = 5              ; Write error bit 1 position
.equ NVMCTRL_ERROR_2_bm = (1<<6)         ; Write error bit 2 mask
.equ NVMCTRL_ERROR_2_bp = 6              ; Write error bit 2 position

; NVMCTRL_ADDR masks
.equ NVMCTRL_ADDR_gm = 0xFFFFFF          ; Address group mask
.equ NVMCTRL_ADDR_gp = 0                 ; Address group position
.equ NVMCTRL_ADDR_0_bm = (1<<0)          ; Address bit 0 mask
.equ NVMCTRL_ADDR_0_bp = 0               ; Address bit 0 position
.equ NVMCTRL_ADDR_1_bm = (1<<1)          ; Address bit 1 mask
.equ NVMCTRL_ADDR_1_bp = 1               ; Address bit 1 position
.equ NVMCTRL_ADDR_2_bm = (1<<2)          ; Address bit 2 mask
.equ NVMCTRL_ADDR_2_bp = 2               ; Address bit 2 position
.equ NVMCTRL_ADDR_3_bm = (1<<3)          ; Address bit 3 mask
.equ NVMCTRL_ADDR_3_bp = 3               ; Address bit 3 position
.equ NVMCTRL_ADDR_4_bm = (1<<4)          ; Address bit 4 mask
.equ NVMCTRL_ADDR_4_bp = 4               ; Address bit 4 position
.equ NVMCTRL_ADDR_5_bm = (1<<5)          ; Address bit 5 mask
.equ NVMCTRL_ADDR_5_bp = 5               ; Address bit 5 position
.equ NVMCTRL_ADDR_6_bm = (1<<6)          ; Address bit 6 mask
.equ NVMCTRL_ADDR_6_bp = 6               ; Address bit 6 position
.equ NVMCTRL_ADDR_7_bm = (1<<7)          ; Address bit 7 mask
.equ NVMCTRL_ADDR_7_bp = 7               ; Address bit 7 position
.equ NVMCTRL_ADDR_8_bm = (1<<8)          ; Address bit 8 mask
.equ NVMCTRL_ADDR_8_bp = 8               ; Address bit 8 position
.equ NVMCTRL_ADDR_9_bm = (1<<9)          ; Address bit 9 mask
.equ NVMCTRL_ADDR_9_bp = 9               ; Address bit 9 position
.equ NVMCTRL_ADDR_10_bm = (1<<10)        ; Address bit 10 mask
.equ NVMCTRL_ADDR_10_bp = 10             ; Address bit 10 position
.equ NVMCTRL_ADDR_11_bm = (1<<11)        ; Address bit 11 mask
.equ NVMCTRL_ADDR_11_bp = 11             ; Address bit 11 position
.equ NVMCTRL_ADDR_12_bm = (1<<12)        ; Address bit 12 mask
.equ NVMCTRL_ADDR_12_bp = 12             ; Address bit 12 position
.equ NVMCTRL_ADDR_13_bm = (1<<13)        ; Address bit 13 mask
.equ NVMCTRL_ADDR_13_bp = 13             ; Address bit 13 position
.equ NVMCTRL_ADDR_14_bm = (1<<14)        ; Address bit 14 mask
.equ NVMCTRL_ADDR_14_bp = 14             ; Address bit 14 position
.equ NVMCTRL_ADDR_15_bm = (1<<15)        ; Address bit 15 mask
.equ NVMCTRL_ADDR_15_bp = 15             ; Address bit 15 position
.equ NVMCTRL_ADDR_16_bm = (1<<16)        ; Address bit 16 mask
.equ NVMCTRL_ADDR_16_bp = 16             ; Address bit 16 position
.equ NVMCTRL_ADDR_17_bm = (1<<17)        ; Address bit 17 mask
.equ NVMCTRL_ADDR_17_bp = 17             ; Address bit 17 position
.equ NVMCTRL_ADDR_18_bm = (1<<18)        ; Address bit 18 mask
.equ NVMCTRL_ADDR_18_bp = 18             ; Address bit 18 position
.equ NVMCTRL_ADDR_19_bm = (1<<19)        ; Address bit 19 mask
.equ NVMCTRL_ADDR_19_bp = 19             ; Address bit 19 position
.equ NVMCTRL_ADDR_20_bm = (1<<20)        ; Address bit 20 mask
.equ NVMCTRL_ADDR_20_bp = 20             ; Address bit 20 position
.equ NVMCTRL_ADDR_21_bm = (1<<21)        ; Address bit 21 mask
.equ NVMCTRL_ADDR_21_bp = 21             ; Address bit 21 position
.equ NVMCTRL_ADDR_22_bm = (1<<22)        ; Address bit 22 mask
.equ NVMCTRL_ADDR_22_bp = 22             ; Address bit 22 position
.equ NVMCTRL_ADDR_23_bm = (1<<23)        ; Address bit 23 mask
.equ NVMCTRL_ADDR_23_bp = 23             ; Address bit 23 position

; Command select
.equ NVMCTRL_CMD_NOCMD_gc = (0x00<<0)    ; No Command
.equ NVMCTRL_CMD_NOOP_gc = (0x01<<0)     ; No Operation
.equ NVMCTRL_CMD_FLPW_gc = (0x04<<0)     ; Flash Page Write
.equ NVMCTRL_CMD_FLPERW_gc = (0x05<<0)   ; Flash Page Erase and Write
.equ NVMCTRL_CMD_FLPER_gc = (0x08<<0)    ; Flash Page Erase
.equ NVMCTRL_CMD_FLMPER2_gc = (0x09<<0)  ; Flash 2-page erase enable
.equ NVMCTRL_CMD_FLMPER4_gc = (0x0A<<0)  ; Flash 4-page erase enable
.equ NVMCTRL_CMD_FLMPER8_gc = (0x0B<<0)  ; Flash 8-page erase enable
.equ NVMCTRL_CMD_FLMPER16_gc = (0x0C<<0) ; Flash 16-page erase enable
.equ NVMCTRL_CMD_FLMPER32_gc = (0x0D<<0) ; Flash 32-page erase enable
.equ NVMCTRL_CMD_FLPBCLR_gc = (0x0F<<0)  ; Flash Page Buffer Clear
.equ NVMCTRL_CMD_EEPW_gc = (0x14<<0)     ; EEPROM Page Write
.equ NVMCTRL_CMD_EEPERW_gc = (0x15<<0)   ; EEPROM Page Erase and Write
.equ NVMCTRL_CMD_EEPER_gc = (0x17<<0)    ; EEPROM Page Erase
.equ NVMCTRL_CMD_EEPBCLR_gc = (0x1F<<0)  ; EEPROM Page Buffer Clear
.equ NVMCTRL_CMD_CHER_gc = (0x20<<0)     ; Chip Erase Command (UPDI only)
.equ NVMCTRL_CMD_EECHER_gc = (0x30<<0)   ; EEPROM Erase Command (UPDI only)

