QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB32def.inc
; Flash Mapping in Data space select
.equ NVMCTRL_FLMAP_SECTION0_gc = (0x00<<4) ; Flash section 0, 0 - 32KB
.equ NVMCTRL_FLMAP_SECTION1_gc = (0x01<<4) ; Flash section 1, 32 - 64KB
.equ NVMCTRL_FLMAP_SECTION2_gc = (0x02<<4) ; Flash section 2, 64 - 96KB
.equ NVMCTRL_FLMAP_SECTION3_gc = (0x03<<4) ; Flash section 3, 96 - 128KB

; Write error select
.equ NVMCTRL_ERROR_NOERROR_gc = (0x00<<4) ; No Error
.equ NVMCTRL_ERROR_WRITEPROTECT_gc = (0x02<<4) ; Attempt to program write protected area
.equ NVMCTRL_ERROR_CMDCOLLISION_gc = (0x03<<4) ; Selecting new write command while write command already seleted
.equ NVMCTRL_ERROR_WRONGSECTION_gc = (0x04<<4) ; Address cannot be written with selected command


;*************************************************************************
;** PORT - I/O Ports
;*************************************************************************

; PORT_INTFLAGS masks
.equ PORT_INT_gm = 0xFF                  ; Pin Interrupt Flag group mask
.equ PORT_INT_gp = 0                     ; Pin Interrupt Flag group position
.equ PORT_INT_0_bm = (1<<0)              ; Pin Interrupt Flag bit 0 mask
.equ PORT_INT_0_bp = 0                   ; Pin Interrupt Flag bit 0 position
.equ PORT_INT_1_bm = (1<<1)              ; Pin Interrupt Flag bit 1 mask
.equ PORT_INT_1_bp = 1                   ; Pin Interrupt Flag bit 1 position
.equ PORT_INT_2_bm = (1<<2)              ; Pin Interrupt Flag bit 2 mask
.equ PORT_INT_2_bp = 2                   ; Pin Interrupt Flag bit 2 position
.equ PORT_INT_3_bm = (1<<3)              ; Pin Interrupt Flag bit 3 mask
.equ PORT_INT_3_bp = 3                   ; Pin Interrupt Flag bit 3 position
.equ PORT_INT_4_bm = (1<<4)              ; Pin Interrupt Flag bit 4 mask
.equ PORT_INT_4_bp = 4                   ; Pin Interrupt Flag bit 4 position
.equ PORT_INT_5_bm = (1<<5)              ; Pin Interrupt Flag bit 5 mask
.equ PORT_INT_5_bp = 5                   ; Pin Interrupt Flag bit 5 position
.equ PORT_INT_6_bm = (1<<6)              ; Pin Interrupt Flag bit 6 mask
.equ PORT_INT_6_bp = 6                   ; Pin Interrupt Flag bit 6 position
.equ PORT_INT_7_bm = (1<<7)              ; Pin Interrupt Flag bit 7 mask
.equ PORT_INT_7_bp = 7                   ; Pin Interrupt Flag bit 7 position

; PORT_PORTCTRL masks
.equ PORT_SRL_bm = 0x01                  ; Slew Rate Limit Enable bit mask
.equ PORT_SRL_bp = 0                     ; Slew Rate Limit Enable bit position

; PORT_PINCONFIG masks
.equ PORT_ISC_gm = 0x07                  ; Input/Sense Configuration group mask
.equ PORT_ISC_gp = 0                     ; Input/Sense Configuration group position
.equ PORT_ISC_0_bm = (1<<0)              ; Input/Sense Configuration bit 0 mask
.equ PORT_ISC_0_bp = 0                   ; Input/Sense Configuration bit 0 position
.equ PORT_ISC_1_bm = (1<<1)              ; Input/Sense Configuration bit 1 mask
.equ PORT_ISC_1_bp = 1                   ; Input/Sense Configuration bit 1 position
.equ PORT_ISC_2_bm = (1<<2)              ; Input/Sense Configuration bit 2 mask
.equ PORT_ISC_2_bp = 2                   ; Input/Sense Configuration bit 2 position
.equ PORT_PULLUPEN_bm = 0x08             ; Pullup enable bit mask
.equ PORT_PULLUPEN_bp = 3                ; Pullup enable bit position
.equ PORT_INLVL_bm = 0x40                ; Input Level Select bit mask
.equ PORT_INLVL_bp = 6                   ; Input Level Select bit position
.equ PORT_INVEN_bm = 0x80                ; Inverted I/O Enable bit mask
.equ PORT_INVEN_bp = 7                   ; Inverted I/O Enable bit position

; PORT_PIN0CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN1CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN2CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN3CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN4CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN5CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN6CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN7CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_EVGENCTRLA masks
.equ PORT_EVGEN0SEL_gm = 0x07            ; Event Generator 0 Select group mask
.equ PORT_EVGEN0SEL_gp = 0               ; Event Generator 0 Select group position
.equ PORT_EVGEN0SEL_0_bm = (1<<0)        ; Event Generator 0 Select bit 0 mask
.equ PORT_EVGEN0SEL_0_bp = 0             ; Event Generator 0 Select bit 0 position
.equ PORT_EVGEN0SEL_1_bm = (1<<1)        ; Event Generator 0 Select bit 1 mask
.equ PORT_EVGEN0SEL_1_bp = 1             ; Event Generator 0 Select bit 1 position
.equ PORT_EVGEN0SEL_2_bm = (1<<2)        ; Event Generator 0 Select bit 2 mask
.equ PORT_EVGEN0SEL_2_bp = 2             ; Event Generator 0 Select bit 2 position
.equ PORT_EVGEN1SEL_gm = 0x70            ; Event Generator 1 Select group mask
.equ PORT_EVGEN1SEL_gp = 4               ; Event Generator 1 Select group position
.equ PORT_EVGEN1SEL_0_bm = (1<<4)        ; Event Generator 1 Select bit 0 mask
.equ PORT_EVGEN1SEL_0_bp = 4             ; Event Generator 1 Select bit 0 position
.equ PORT_EVGEN1SEL_1_bm = (1<<5)        ; Event Generator 1 Select bit 1 mask
.equ PORT_EVGEN1SEL_1_bp = 5             ; Event Generator 1 Select bit 1 position
.equ PORT_EVGEN1SEL_2_bm = (1<<6)        ; Event Generator 1 Select bit 2 mask
.equ PORT_EVGEN1SEL_2_bp = 6             ; Event Generator 1 Select bit 2 position

; Event Generator 0 Select
.equ PORT_EVGEN0SEL_PIN0_gc = (0x00<<0)  ; Pin 0 used as event generator
.equ PORT_EVGEN0SEL_PIN1_gc = (0x01<<0)  ; Pin 1 used as event generator
.equ PORT_EVGEN0SEL_PIN2_gc = (0x02<<0)  ; Pin 2 used as event generator
.equ PORT_EVGEN0SEL_PIN3_gc = (0x03<<0)  ; Pin 3 used as event generator
.equ PORT_EVGEN0SEL_PIN4_gc = (0x04<<0)  ; Pin 4 used as event generator
.equ PORT_EVGEN0SEL_PIN5_gc = (0x05<<0)  ; Pin 5 used as event generator
.equ PORT_EVGEN0SEL_PIN6_gc = (0x06<<0)  ; Pin 6 used as event generator
.equ PORT_EVGEN0SEL_PIN7_gc = (0x07<<0)  ; Pin 7 used as event generator

