QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB32def.inc
; TCF_CMP masks
.equ TCF_CMP_gm = 0xFFFFFF               ; Compare group mask
.equ TCF_CMP_gp = 0                      ; Compare group position
.equ TCF_CMP_0_bm = (1<<0)               ; Compare bit 0 mask
.equ TCF_CMP_0_bp = 0                    ; Compare bit 0 position
.equ TCF_CMP_1_bm = (1<<1)               ; Compare bit 1 mask
.equ TCF_CMP_1_bp = 1                    ; Compare bit 1 position
.equ TCF_CMP_2_bm = (1<<2)               ; Compare bit 2 mask
.equ TCF_CMP_2_bp = 2                    ; Compare bit 2 position
.equ TCF_CMP_3_bm = (1<<3)               ; Compare bit 3 mask
.equ TCF_CMP_3_bp = 3                    ; Compare bit 3 position
.equ TCF_CMP_4_bm = (1<<4)               ; Compare bit 4 mask
.equ TCF_CMP_4_bp = 4                    ; Compare bit 4 position
.equ TCF_CMP_5_bm = (1<<5)               ; Compare bit 5 mask
.equ TCF_CMP_5_bp = 5                    ; Compare bit 5 position
.equ TCF_CMP_6_bm = (1<<6)               ; Compare bit 6 mask
.equ TCF_CMP_6_bp = 6                    ; Compare bit 6 position
.equ TCF_CMP_7_bm = (1<<7)               ; Compare bit 7 mask
.equ TCF_CMP_7_bp = 7                    ; Compare bit 7 position
.equ TCF_CMP_8_bm = (1<<8)               ; Compare bit 8 mask
.equ TCF_CMP_8_bp = 8                    ; Compare bit 8 position
.equ TCF_CMP_9_bm = (1<<9)               ; Compare bit 9 mask
.equ TCF_CMP_9_bp = 9                    ; Compare bit 9 position
.equ TCF_CMP_10_bm = (1<<10)             ; Compare bit 10 mask
.equ TCF_CMP_10_bp = 10                  ; Compare bit 10 position
.equ TCF_CMP_11_bm = (1<<11)             ; Compare bit 11 mask
.equ TCF_CMP_11_bp = 11                  ; Compare bit 11 position
.equ TCF_CMP_12_bm = (1<<12)             ; Compare bit 12 mask
.equ TCF_CMP_12_bp = 12                  ; Compare bit 12 position
.equ TCF_CMP_13_bm = (1<<13)             ; Compare bit 13 mask
.equ TCF_CMP_13_bp = 13                  ; Compare bit 13 position
.equ TCF_CMP_14_bm = (1<<14)             ; Compare bit 14 mask
.equ TCF_CMP_14_bp = 14                  ; Compare bit 14 position
.equ TCF_CMP_15_bm = (1<<15)             ; Compare bit 15 mask
.equ TCF_CMP_15_bp = 15                  ; Compare bit 15 position
.equ TCF_CMP_16_bm = (1<<16)             ; Compare bit 16 mask
.equ TCF_CMP_16_bp = 16                  ; Compare bit 16 position
.equ TCF_CMP_17_bm = (1<<17)             ; Compare bit 17 mask
.equ TCF_CMP_17_bp = 17                  ; Compare bit 17 position
.equ TCF_CMP_18_bm = (1<<18)             ; Compare bit 18 mask
.equ TCF_CMP_18_bp = 18                  ; Compare bit 18 position
.equ TCF_CMP_19_bm = (1<<19)             ; Compare bit 19 mask
.equ TCF_CMP_19_bp = 19                  ; Compare bit 19 position
.equ TCF_CMP_20_bm = (1<<20)             ; Compare bit 20 mask
.equ TCF_CMP_20_bp = 20                  ; Compare bit 20 position
.equ TCF_CMP_21_bm = (1<<21)             ; Compare bit 21 mask
.equ TCF_CMP_21_bp = 21                  ; Compare bit 21 position
.equ TCF_CMP_22_bm = (1<<22)             ; Compare bit 22 mask
.equ TCF_CMP_22_bp = 22                  ; Compare bit 22 position
.equ TCF_CMP_23_bm = (1<<23)             ; Compare bit 23 mask
.equ TCF_CMP_23_bp = 23                  ; Compare bit 23 position

; Clock Prescaler select
.equ TCF_PRESC_DIV1_gc = (0x00<<1)       ; Runs directly on Clock Source
.equ TCF_PRESC_DIV2_gc = (0x01<<1)       ; Divide clock source by 2
.equ TCF_PRESC_DIV4_gc = (0x02<<1)       ; Divide clock source by 4
.equ TCF_PRESC_DIV8_gc = (0x03<<1)       ; Divide clock source by 8
.equ TCF_PRESC_DIV16_gc = (0x04<<1)      ; Divide clock source by 16
.equ TCF_PRESC_DIV32_gc = (0x05<<1)      ; Divide clock source by 32
.equ TCF_PRESC_DIV64_gc = (0x06<<1)      ; Divide clock source by 64
.equ TCF_PRESC_DIV128_gc = (0x07<<1)     ; Divide clock source by 128

; Clock Select
.equ TCF_CLKSEL_CLKPER_gc = (0x00<<3)    ; Peripheral Clock
.equ TCF_CLKSEL_EVENT_gc = (0x01<<3)     ; Event as clock source
.equ TCF_CLKSEL_OSCHF_gc = (0x02<<3)     ; Internal High Frequency Oscillator
.equ TCF_CLKSEL_OSC32K_gc = (0x03<<3)    ; Internal 32.768 kHz Oscillator
.equ TCF_CLKSEL_PLL_gc = (0x05<<3)       ; PLL

; Compare # Event Generation select
.equ TCF_CMP1EV_PULSE_gc = (0x00<<7)     ; Event is generated as pulse
.equ TCF_CMP1EV_WAVEFORM_gc = (0x01<<7)  ; Waveform is used as event output

; Waveform Generation Mode select
.equ TCF_WGMODE_FRQ_gc = (0x00<<0)       ; Frequency
.equ TCF_WGMODE_NCOPF_gc = (0x01<<0)     ; Numerically Controlled Oscillator Pulse-Frequency
.equ TCF_WGMODE_NCOFDC_gc = (0x02<<0)    ; Numerically Controlled Oscillator Fixed Duty Cycle
.equ TCF_WGMODE_PWM8_gc = (0x07<<0)      ; 8-bit PWM

; Waveform Generation Pulse Length select
.equ TCF_WGPULSE_CLK1_gc = (0x00<<4)     ; High pulse duration is 1 clock period
.equ TCF_WGPULSE_CLK2_gc = (0x01<<4)     ; High pulse duration is 2 clock period
.equ TCF_WGPULSE_CLK4_gc = (0x02<<4)     ; High pulse duration is 4 clock period
.equ TCF_WGPULSE_CLK8_gc = (0x03<<4)     ; High pulse duration is 8 clock period
.equ TCF_WGPULSE_CLK16_gc = (0x04<<4)    ; High pulse duration is 16 clock period
.equ TCF_WGPULSE_CLK32_gc = (0x05<<4)    ; High pulse duration is 32 clock period
.equ TCF_WGPULSE_CLK64_gc = (0x06<<4)    ; High pulse duration is 64 clock period
.equ TCF_WGPULSE_CLK128_gc = (0x07<<4)   ; High pulse duration is 128 clock period

; Waveform Output # Polarity select
.equ TCF_WO1POL_NORMAL_gc = (0x00<<3)    ; Waveform output set on update and cleared on match
.equ TCF_WO1POL_INVERSE_gc = (0x01<<3)   ; Waveform output cleared on update and set on match

; Command select
.equ TCF_CMD_NONE_gc = (0x00<<0)         ; No command
.equ TCF_CMD_UPDATE_gc = (0x01<<0)       ; Force update
.equ TCF_CMD_RESTART_gc = (0x02<<0)      ; Force restart

; Event Action A select
.equ TCF_EVACTA_RESTART_gc = (0x00<<1)   ; Restart Counter
.equ TCF_EVACTA_BLANK_gc = (0x01<<1)     ; Mask waveform output to '0'


;*************************************************************************
;** TWI - Two-Wire Interface
;*************************************************************************

; TWI_CTRLA masks
.equ TWI_FMEN_bm = 0x01                  ; Fast-mode Enable bit mask
.equ TWI_FMEN_bp = 0                     ; Fast-mode Enable bit position
.equ TWI_FMPEN_bm = 0x02                 ; Fast-mode Plus Enable bit mask
.equ TWI_FMPEN_bp = 1                    ; Fast-mode Plus Enable bit position
.equ TWI_SDAHOLD_gm = 0x0C               ; SDA Hold Time group mask
.equ TWI_SDAHOLD_gp = 2                  ; SDA Hold Time group position
.equ TWI_SDAHOLD_0_bm = (1<<2)           ; SDA Hold Time bit 0 mask
.equ TWI_SDAHOLD_0_bp = 2                ; SDA Hold Time bit 0 position
.equ TWI_SDAHOLD_1_bm = (1<<3)           ; SDA Hold Time bit 1 mask
.equ TWI_SDAHOLD_1_bp = 3                ; SDA Hold Time bit 1 position
.equ TWI_SDASETUP_bm = 0x10              ; SDA Setup Time bit mask
.equ TWI_SDASETUP_bp = 4                 ; SDA Setup Time bit position
.equ TWI_INPUTLVL_bm = 0x40              ; Input voltage transition level bit mask
.equ TWI_INPUTLVL_bp = 6                 ; Input voltage transition level bit position

; TWI_DUALCTRL masks
.equ TWI_ENABLE_bm = 0x01                ; Enable bit mask
.equ TWI_ENABLE_bp = 0                   ; Enable bit position
; Masks for TWI_FMPEN already defined
; Masks for TWI_SDAHOLD already defined
; Masks for TWI_INPUTLVL already defined

; TWI_DBGCTRL masks
.equ TWI_DBGRUN_bm = 0x01                ; Debug Run bit mask
.equ TWI_DBGRUN_bp = 0                   ; Debug Run bit position

; TWI_MCTRLA masks
; Masks for TWI_ENABLE already defined
.equ TWI_SMEN_bm = 0x02                  ; Smart Mode Enable bit mask
.equ TWI_SMEN_bp = 1                     ; Smart Mode Enable bit position
.equ TWI_TIMEOUT_gm = 0x0C               ; Inactive Bus Time-Out group mask
.equ TWI_TIMEOUT_gp = 2                  ; Inactive Bus Time-Out group position
.equ TWI_TIMEOUT_0_bm = (1<<2)           ; Inactive Bus Time-Out bit 0 mask
.equ TWI_TIMEOUT_0_bp = 2                ; Inactive Bus Time-Out bit 0 position
.equ TWI_TIMEOUT_1_bm = (1<<3)           ; Inactive Bus Time-Out bit 1 mask
.equ TWI_TIMEOUT_1_bp = 3                ; Inactive Bus Time-Out bit 1 position
.equ TWI_QCEN_bm = 0x10                  ; Quick Command Enable bit mask
.equ TWI_QCEN_bp = 4                     ; Quick Command Enable bit position
.equ TWI_WIEN_bm = 0x40                  ; Write Interrupt Enable bit mask
.equ TWI_WIEN_bp = 6                     ; Write Interrupt Enable bit position
.equ TWI_RIEN_bm = 0x80                  ; Read Interrupt Enable bit mask
.equ TWI_RIEN_bp = 7                     ; Read Interrupt Enable bit position

